"Please Donate" = "Kérjük adományozzon";
"Donate" = "Adományoz";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Ez egy ingyenes szoftver, de mégis pénzbe kerül az írása, karbantartása és kiadása. Ha megtetszett a használata, kérjük gondolja át az adományozást a szoftver fejlesztőinek. Ez segít még jobbá tenni a Cyberduck-ot!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Mint hozzájáruló a Cyberduck-hoz, kap egy regisztrációs kulcsot, mely kikapcsolja ezt az üzenetet.";
"Thank you for using Cyberduck!" = "Köszönjük, hogy a Cyberduck-ot használja!";
"Later" = "Később";
"Don't show again for this version" = "Ne mutassa újra ennél a verziónál";
"Registration Key" = "Regisztrációs kulcs";

"Buy in Windows Store" = "Megvásárol a Windows Áruházban";
"Buy in Mac App Store" = "Megvásárol a Mac App Store-ban";
